---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridInGridChainCannotMirror
source: html/ce5091ef-351c-f795-ea37-550e7087235b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridInGridChainCannotMirror Property

A grid that is a sub-grid of a multi-segment grid can only be mirrored if the entire multi-segment grid is being mirrored.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridInGridChainCannotMirror { get; }
```